tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"



# misc macOs apps
cask "zoomus"
cask "the-unarchiver"
mas "Cleaner-App", id: 1013897218
mas "HazeOver", id: 430798174
mas "Spark", id: 1176895641
mas "Slack", id: 803453959
cask "transmission"
cask "vlc"
cask "google-chrome"
cask "tunnelblick"
cask "slack"
cask "telegram-desktop"
cask "openinterminal"


# handy macos tools
cask "keyboard-cleaner"
cask "rectangle"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "maccy"

# programming desktop apps
cask "hyper"
cask "tableplus"
cask "postman"
cask "pycharm"
cask "goland"

# programming languages support
brew "python@3.9"
brew "go"
brew "node"

# utils
brew "curl"
brew "diff-so-fancy"
brew "gh"
brew "git"
brew "git-delta"

brew "docker-clean"
brew "docker-compose"
cask "docker"

brew "readline"
brew "mas"
brew "wget"




